### Q_1: Create a Pandas Series named survival_series using the Survived column of the DataFrame

In [35]:
import pandas as pd
data = {
    'Name': ['Saleh', 'Aya', 'Mohamed', 'Mona', 'Mohsen'],
    'Age': [22, 34, None, 19, None],
    'Survived': [13, 84, 34, 28, 62],
}
df = pd.DataFrame(data)
survival_series = df['Survived']
print(survival_series)

0    13
1    84
2    34
3    28
4    62
Name: Survived, dtype: int64

### Q_2: Display the last 3 rows of the DataFrame and check the data type of the Age column

In [36]:
print(df.tail(3))
print('============')
print(df['Age'].dtype)

      Name   Age  Survived
2  Mohamed   NaN        34
3     Mona  19.0        28
4   Mohsen   NaN        62
============
float64

### Q_3 :  Select the Name and Age columns, then filter rows where the passengerâ€™s age is greater than 30

In [37]:
df_sel=df[['Name','Age']]
print(df_sel['Age']>30)

0    False
1     True
2    False
3    False
4    False
Name: Age, dtype: bool

### Q_4: Add a new column FamilySize to the DataFrame, calculated as SibSp + Parch + 1 (including the passenger themselves)

In [38]:
df['FamilySize']=[21,34,62,14,10]
df

      Name   Age  Survived  FamilySize
0    Saleh  22.0        13          21
1      Aya  34.0        84          34
2  Mohamed   NaN        34          62
3     Mona  19.0        28          14
4   Mohsen   NaN        62          10

#### Q_5: Fill missing values in the Age column with the mean age then Group the data by Pclass and calculate the average age for each class

In [39]:
df.isna().sum()
age_mean = df['Age'].mean()
print(age_mean)
df.fillna({'Age': age_mean}, inplace=True)
df

25.0

      Name   Age  Survived  FamilySize
0    Saleh  22.0        13          21
1      Aya  34.0        84          34
2  Mohamed  25.0        34          62
3     Mona  19.0        28          14
4   Mohsen  25.0        62          10

#### Q_Bonus: Calculate the survival rate (mean of Survived) for each gender (Sex)

In [40]:
df['Sex']=['Male','Female','Male','Female','Male']
df['Survival_Rate']=[None,None,None,None,None]
survival_rate_by_gender = df.groupby('Sex')['Survived'].mean()
def survival_rate(sex):
    return survival_rate_by_gender[sex]
df['Survival_Rate'] = df['Sex'].apply(survival_rate)
df

      Name   Age  Survived  FamilySize     Sex  Survival_Rate
0    Saleh  22.0        13          21    Male      36.333333
1      Aya  34.0        84          34  Female      56.000000
2  Mohamed  25.0        34          62    Male      36.333333
3     Mona  19.0        28          14  Female      56.000000
4   Mohsen  25.0        62          10    Male      36.333333